import video1 from '../video/1.mp4';
import video2 from '../video/2.mp4';
import video3 from '../video/3.mp4';
import video4 from '../video/4.mp4';
import video5 from '../video/5.mp4';
import video6 from '../video/6.mp4';
import video7 from '../video/7.mp4';
import video8 from '../video/8.mp4';
import video9 from '../video/9.mp4';
import video10 from '../video/10.mp4';
import video11 from '../video/11.mp4';

const steps = [
  {
    date: '862 год',
    text: 'Приход князей Рюрика, Синеуса, Трувора',
    video: video1,
    id: 1,
    description: ['Приход князей Рюрика, Синеуса, Трувора спорного (шведско-славянского?) происхождения. Бесспорна их локация: Северная Русь, Новгородчина.', 'Отсюда их дружинники Аскольд, Дир, а затем и ближайший родич Олег с Игорем Рюриковичем пришли в Киев.', 'Именно об этом движении русской государственности свидетельствует Киевский монах Нестор («Повести временных лет») – древнейшая из сохранившихся летописей. Все прочие легенды о Кие, Щеке, Хориве, сестрице Лыбеди - по аутентичности равны легендам о «выкопанном украинцами Черном море».'],
  },
  {
    date: '907—911 года',
    text: 'Походы князя Олега на Византию',
    video: video2,
    id: 2,
    description: ['Походы князя Олега на Византию. Византийские императоры Лев VI и Александр, уплатив дань, подписали договора «с Русью».'],
  },
  {
    date: '988—989 года',
    text: 'Крещение Руси князем Владимиром',
    video: video3,
    id: 3,
    description: ['Крещение Руси князем Владимиром.'],
  },
  {
    date: '1238—1240 года',
    text: 'Нашествие хана Батыя',
    video: video4,
    id: 4,
    description: ['1238 г. Захват монголо-татарами Владимиро-Суздальской Руси.', '1240 г. Захват монголо-татарами Киева.'],
  },
  {
    date: '1340—1362 года',
    text: 'Захват литовскими князьями русских земель',
    video: video5,
    id: 5,
    description: ['Захват литовскими князьями юго-западных русских земель. Начало порозненного государственного бытия - северной (под властью Орды) и южной (под властью Литвы) частей Древней Руси.', 'Первое объяснение значения слова «Украина» в главной книге украинских националистов, “Iсторii Украiни-Руси” Михаила Грушевского относится к этому периоду и звучит так: «Зажурилась Украiна, що нiде прожити, Витоитала орда кiньми  маленькii  дiти».', 'Поднепровье обратилось в пустыню. Одичало и заросло в течение нескольких десятков лет, как какая-нибудь дикая страна. Но эти роскошные, дикие пустыни, этой край крещеного мира, потому и получивший специальное название Украины, привлекал к себе население своим диким привольем. Т.е. топографическое «край», дополняется, песенно-бытовым значением. Таковым, вне какого-либо государственного значения термин «О(У)краина» остается до середины 1917 г.'],
  },
  {
    date: '1385 год',
    text: 'Кревская уния Литвы и Польши',
    video: video6,
    id: 6,
    description: ['Кревская уния Литвы и Польши. Начало католического давления поляков на православное русско-литовское население.'],
  },
  {
    date: '1500—1503 года',
    text: 'Русско-литовская война и Благовещенский договор',
    video: video7,
    id: 7,
    description: ['Православные князья Северской Руси (Черниговщина), Барятинские, Мосальские, Воротынские из-за политики насильственного окатоличивания переходят к России вместе со своими землями, поданными. Это вызывает Русско-литовскую войну.', 'Благовещенский договор России и Великого княжества Литовского закрепляет удачный для России результат войны. Черниговщина/Северская Русь переходят из Руси Литовской в Русь Московскую. За полтора века до Хмельницкого и Переяславской Рады!'],
  },
  {
    date: '1552—1556 года',
    text: 'Создание первой Запорожской Сечи старостой Вишневецким',
    video: video8,
    id: 8,
    description: ['Основание старостой Вишневецким первой Запорожской Сечи (остров Малая Хортица на Днепре).', 'Последующие Сечи: Томаковская (1570-е гг.), Базавлукская (1593 г.), Чертомлыкская (1652 г.).'],
  },
  {
    date: '1648—1654 года',
    text: 'Гетман Богдан Хмельницкий и национально-освободительная война',
    video: video9,
    id: 9,
    description: ['Национально-освободительная война под предводительством гетмана Богдана Хмельницкого.', '8 января 1652 г. Переяславская рада приняла решение о вхождении «Войска Запорожского» (никакого упоминания Украины) в состав России. “Волим под царя Московского православного,” –  решение Войска, территория которого в тот момент включала часть нынешних Днепропетровской и Черкасских областей, общей площадью менее 1/8 от территории Украины в границах 1991 г. От титула главы казаков – «гетман», происходит второе название этих земель: Гетманщина.', 'Указом царя Алексея Михайловича основан город Харьков, административный центр российского пограничного с Крымским ханством района Слободских казацких полков.'],
  },
  {
    date: '1667—1668 года',
    text: 'Андрусовское перемирие и «Вечный мир»',
    video: video10,
    id: 10,
    description: ['Андрусовсское перемирие (1667 г.) и «Вечный мир» (1686 г.) между Россией и Речью Посполитой фиксировал присоединение к России земель на Левобережье Днепра, но с Киевом (временно, за выкуп).'],
  },
  {
    date: '1700—1721 года',
    text: 'Северная война России со Швецией',
    video: video11,
    id: 11,
    description: ['28 сентября 1708 г. переход гетмана Мазепы на сторону шведов.', '11 мая 1709 г. по указу Петра I разрушена Запорожская Сечь.', '8 июля 1709 г. произошла Полтавская битва.',],
  },
]

export default steps;